from aiogram.types import ReplyKeyboardMarkup, KeyboardButton

choice_language = ReplyKeyboardMarkup(resize_keyboard=True)
kaz_language = KeyboardButton('🇷🇺Русский')
rus_language = KeyboardButton('🇰🇿Қазақша')
choice_language.add(kaz_language, rus_language)

start_cmd_back = ReplyKeyboardMarkup(resize_keyboard=True)
btn_start = KeyboardButton('/start')
start_cmd_back.add(btn_start)

qtm_r_dict = {
    '''Нужные документы 
при создании карточки VISA/MasterCard?''': """Для гражданинов РК: 
Содержащий ИИН (свидетельство о рождении,паспорт гражданина РК,вид на жительство иностранца РК,), удостоверяющий личность, документы


Для не граждан РК: 
Удостоверяющий личность (удостоверение лица без гражданства, заграничный паспорт),документ 
Регистрационное свидетельство о регистрации нерезидента в качестве налогоплательщика, содержащее ИИН (в случае отсутствия документов Республики Казахстан, удостоверяющих личность); 
Документ, удостоверяющий регистрацию в уполномоченных органах РК на право въезда, выезда и пребывания физического лица–нерезидента на территории РК, если иное не предусмотрено международными договорами, ратифицированными РК.""",

    'Как пополнить баланс через карту?':'''Взнос наличных через кассу банка; 
Через банкоматы с функцией Cash In/ Платежные Терминалы; 
Безналичный перевод средств (как внутрибанковский, так и из другого банка); 
Автоматическое зачисление зарплаты работодателем; 
Перевод со счета/карты через cистему BCC.KZ.''',

    '''В каких случаях выдается замена 
карточки?''': '''Замена карточки выдается, если: 
1.Истек срок действия карточки (бесплатно) 
2.Карточка повреждена 
3.Рассекречен ПИН-код 
4.Клиент забыл ПИН-код 
5.По желанию клиента''',
    '''Какая комиссия за пользование системой 
BCC.KZ?''':"""Стоимость платежей за услуги - 0 тенге (Абонентская плата за обслуживание - 0 тенге)""",
    """Как правильно использовать систему 
BCC.KZ?""":"""Использовать систему можно через: 
web-приложение по адресу: https://m.bcc.kz а также мобильное приложение BCC.KZ""",
    """Где я могу ознакомиться с описанием 
системы BCC.KZ?""":"""С подробным описанием систем Вы можете ознакомиться, перейдя по ссылке: https://www.bcc.kz/product/BCC.KZ/""",
    '''Сколько состоит максимальная сумма 
займа?''':"""Максимальная сумма займа - 7 000 000 тенге.""",
    """Какова комиссия банка за оформление 
кредита?""": """Комиссия за рассмотрение заявки - 0 тенге 
Комиссия банка за оформление кредита составляет 5% от суммы займа (min 4500 тенге).
Комиссия банка за оформление кредита составляет 10% от суммы займа (min 4500 тенге).""",
    """Какие требования относительно к 
возрасту заёмщиков?""":"""Займы предоставляются заёмщикам, возрастом от 21 года на момент выдачи займа и до 68 лет.""",
    'За сколько дней выдается кредит?': """Займы устанавливается уполномоченным органом Банка в рамках срока действия депозита, при этом срок депозита должен превышать срок займов не менее чем на 3 (три) рабочих дня.""",
    "Кто может выступать залогодателем?": """Залогодателем депозита может выступать как сам Заемщик, так и любое другое физическое или юридическое лицо. Не принимаются в залог депозиты, являющиеся резервами страховых компаний, средства различных фондов, общественных объединений и т.п.""",
    "Какие преимущества кредита?": """1.Низкие процентные ставки
2.Индивидуальный график погашения (с возможностью погашения основного долга в конце срока займа)
3.Возможность сохранения действующих условий по депозиту
4.Быстрые сроки рассмотрения и выдачи кредита
5.Экономическая экспертиза проекта не требуется""",
    """Сколько берется комиссия за открытие 
счета?""": """Открытие текущего счета для физических лиц – 500 тенге.""",
    "Есть ли ограничения по переводу сумм?": """Ограничений по переводу сумм нет. Уполномоченный банк передает информацию о платежах и переводах средств клиентов (физических лиц) в Национальный Банк РК при отсутствии у физического лица возможности предоставить подтверждающие документы об операциях, осуществленных в течение календарного месяца, если сумма платежа и (или) перевода денег через один уполномоченный банк превысила эквивалент 50 000 долларов США.""",
    """Какие данные должен знать получатель, 
чтобы получить перевод?""": """Получатель должен знать: 
1.контрольный номер перевода;
2.полное ФИО отправителя; 
3.страну и город отправления; 
4.сумму перевода; 
5.ответ на контрольный вопрос (если вопрос включен в перевод).""",
    """Возможно ли открытие лимита по 
гарантии?""": """Клиентам, пользующимся тендерными гарантиями, может открываться лимит по гарантиям. Каждая последующая выдача гарантийных обязательств, предоставляемых клиенту в рамках открываемого лимита по гарантиям, осуществляется на возобновляемой основе. 
Срок лимита, сумма открываемого лимита и размер взимаемой комиссии за предоставление гарантии устанавливается полномочным органом Банка.""",
    """Какие виды гарантий предоставляет 
банк?""": """Банк предоставляет следующие виды платежных гарантий: 
1.Гарантия платежа - обеспечение исполнения платежных претензий продавца к покупателю относительно оплаты контрактной стоимости товара (работ, услуг) в течение оговоренного срока. 
2.Гарантия исполнения обязательств – обеспечение исполнения любых претензий (в основном оплаты штрафных санкций в случае не поставки/невыполнения) покупателя (заказчика) в отношении продавца (подрядчика), которые могут возникнуть в силу неисполнения или ненадлежащего исполнения последним условий заключенного между ними контракта. 
3.Гарантия возврата авансового платежа – банковская гарантия, обеспечивающая возврат Принципалом Бенефициару суммы авансового платежа (или его неиспользованную часть) в случае неисполнения (полного или частичного) Принципалом контрактных обязательств в установленные сроки.
4.Гарантия целевого использования авансового платежа – банковская гарантия Бенефициару об использовании предоставленного Принципалу авансового платежа исключительно на цели, указанные в заключенном Договоре и в соответствии со спецификацией к Договору. 
5.Гарантия в пользу таможни – обеспечение исполнения обязательств клиента банка по уплате таможенных платежей. 
6.Гарантии качества – обеспечение платежных претензий бенефициара к клиенту банка, которые могут возникнуть в связи с порчей товаров (некачественным выполнением работ, услуг) в течение гарантийного периода.""",
    "Как проводится выплата по гарантии?": """Выплаты Гарантом производятся за счет средств Банка в течение 3 рабочих дней после получения письменного требования Бенефициара, в соответствии с условиями гарантийного обязательства. 
Для обоснования претензии по платежной гарантии Бенефициар должен предоставить свое письменное заявление, с приложением письменных документов, подтверждающих, что принципал не исполнил обязательств, обеспеченных гарантией, если иное не предусмотрено гарантией.
В случае проведения выплат банком по гарантийному обязательству, выпущенному в рамках лимита кредитования (кредитной линии), дальнейший выпуск гарантий в рамках данного лимита приостанавливается.""",
    """Какие документы необходимо
предоставить в банк для открытия 
вклада?""": """Перечень документов для открытия временного сберегательного счета для вновь создаваемого юридического лица:
1.Заявление на открытие временного сберегательного счета; 
2.Документ, удостоверяющий личность клиента, содержащий ИИН;
3.Один экземпляр документа с образцом подписи вкладчика; 
4.Копия документа (-ов), удостоверяющего (-их) личность лица (лиц) (содержащего (-их) ИИН), уполномоченного (-ых) подписывать платежные документы при совершении операций, связанных с ведением временного сберегательного счета в соответствии с документом с образцом подписи;
5.Копия протокола учредителей создаваемого юридического лица о назначении физического лица, уполномоченного на открытие и закрытие временного сберегательного счета.""",
    """Для чего и кем открывается специальный 
текущий счет?""": """Специальный текущий счет открывается для получения выплат из Государственного центра по выплате пенсий и пособий (ГЦВП).
Специальный текущий счет может быть открыт:
*гражданам, получающим пособия по рождению/ уходу за ребенком и т.д.
*клиентам, получающим пособия от ГЦВП.""",
    """Возможно ли пополнение вклада через 
другие отделения банка?""": """Владелец счета может производить пополнение вклада в любом отделении банка, независимо от того, в каком отделении был открыт депозит."""
}

quick_translate_menu_r = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_r1 = KeyboardButton('Карточки для платежа VISA/Mastercard')
qtm_r2 = KeyboardButton('Система банка')
qtm_r3 = KeyboardButton('Переводы')
qtm_r4 = KeyboardButton('Кредитование')
qtm_r5 = KeyboardButton('Счета бизнес-клиентов')
qtm_r6 = KeyboardButton('Гарантии')
qtm_r7 = KeyboardButton('Депозиты физических лиц')
open_card_question = KeyboardButton('Открыть карту нашего банка💳')
location_bank = KeyboardButton('Ближайшее отделении и банкоматы🏦')
connect_option = KeyboardButton('Связаться с оператором')
depozit_option = KeyboardButton('Оставить заявку на депозит нашего банка💴')
quick_translate_menu_r.add(open_card_question)
quick_translate_menu_r.add(location_bank)
quick_translate_menu_r.add(depozit_option)
quick_translate_menu_r.add(qtm_r1)
quick_translate_menu_r.add(qtm_r2)
quick_translate_menu_r.add(qtm_r3)
quick_translate_menu_r.add(qtm_r4)
quick_translate_menu_r.add(qtm_r5)
quick_translate_menu_r.add(qtm_r6)
quick_translate_menu_r.add(qtm_r7)
quick_translate_menu_r.add(connect_option)



quick_translate_menu_r_list = [qtm_r1.text, qtm_r2.text, qtm_r3.text, qtm_r4.text, qtm_r5.text, qtm_r6.text, qtm_r7.text]

qtm_r1_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_r1_1 = '''Нужные документы 
при создании карточки VISA/MasterCard?'''
qtm_r1_2 = 'Как пополнить баланс через карту?'
qtm_r1_3 = '''В каких случаях выдается замена 
карточки?'''
qtm_back_r = '⬅️Назад'
qtm_r1_open.add(qtm_r1_1)
qtm_r1_open.add(qtm_r1_2)
qtm_r1_open.add(qtm_r1_3)
qtm_r1_open.add(qtm_back_r)

qtm_r2_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_r2_1 = '''Какая комиссия за пользование системой 
BCC.KZ?'''
qtm_r2_2 = """Как правильно использовать систему 
BCC.KZ?"""
qtm_r2_3 = """Где я могу ознакомиться с описанием 
системы BCC.KZ?"""
qtm_back_r = '⬅️Назад'
qtm_r2_open.add(qtm_r2_1)
qtm_r2_open.add(qtm_r2_2)
qtm_r2_open.add(qtm_r2_3)
qtm_r2_open.add(qtm_back_r)

qtm_r3_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_r3_1 = '''Сколько состоит максимальная сумма 
займа?'''
qtm_r3_2 = """Какова комиссия банка за оформление 
кредита?"""
qtm_r3_3 = """Какие требования относительно к 
возрасту заёмщиков?"""
qtm_back_r = '⬅️Назад'
qtm_r3_open.add(qtm_r3_1)
qtm_r3_open.add(qtm_r3_2)
qtm_r3_open.add(qtm_r3_3)
qtm_r3_open.add(qtm_back_r)

qtm_r4_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_r4_1 = 'За сколько дней выдается кредит?'
qtm_r4_2 = "Кто может выступать залогодателем?"
qtm_r4_3 = "Какие преимущества кредита?"
qtm_back_r = '⬅️Назад'
qtm_r4_open.add(qtm_r4_1)
qtm_r4_open.add(qtm_r4_2)
qtm_r4_open.add(qtm_r4_3)
qtm_r4_open.add(qtm_back_r)

qtm_r5_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_r5_1 = """Сколько берется комиссия за открытие 
счета?"""
qtm_r5_2 = "Есть ли ограничения по переводу сумм?"
qtm_r5_3 = """Какие данные должен знать получатель, 
чтобы получить перевод?"""
qtm_back_r = '⬅️Назад'
qtm_r5_open.add(qtm_r5_1)
qtm_r5_open.add(qtm_r5_2)
qtm_r5_open.add(qtm_r5_3)
qtm_r5_open.add(qtm_back_r)

qtm_r6_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_r6_1 = """Возможно ли открытие лимита по 
гарантии?"""
qtm_r6_2 = """Какие виды гарантий предоставляет 
банк?"""
qtm_r6_3 = "Как проводится выплата по гарантии?"
qtm_back_r = '⬅️Назад'
qtm_r6_open.add(qtm_r6_1)
qtm_r6_open.add(qtm_r6_2)
qtm_r6_open.add(qtm_r6_3)
qtm_r6_open.add(qtm_back_r)

qtm_r7_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_r7_1 = """Какие документы необходимо
предоставить в банк для открытия 
вклада?"""
qtm_r7_2 = """Для чего и кем открывается специальный 
текущий счет?"""
qtm_r7_3 = """Возможно ли пополнение вклада через 
другие отделения банка?"""
qtm_back_r = '⬅️Назад'
qtm_r7_open.add(qtm_r7_1)
qtm_r7_open.add(qtm_r7_2)
qtm_r7_open.add(qtm_r7_3)
qtm_r7_open.add(qtm_back_r)

gtm_k_dict = {
    '''VISA/MasterCard картасына өтініш беру 
кезінде қажетті құжаттар?''': """ҚР азаматтары үшін: 
Жеке басын куәландыратын ЖСН (туу туралы куәлік,ҚР азаматының паспорты, ҚР шетелдігінің тұруға ықтиярхаты), құжаттар""",
    '''Карточка арқылы балансты қалай 
толтыруға болады?''': """Банк кассасы арқылы қолма-қол ақша жарнасы;
Сash in функциясы бар банкоматтар / төлем терминалдары арқылы;
Колма-қол ақшасыз ақша аудару (банктен және басқа банктен);
Жұмыс берушінің жалақыны автоматты түрде есептеуі;
Жүйе арқылы шоттан/картадан аудару BCC.KZ.""",
    '''Картаны қандай жағдайларда ауыстыруға 
болады?''': """Карточканы ауыстыру, егер:
1.Карточканың мерзімі аяқталды (тегін)
2.Карточкаңыз бүлінген жағдайда
3.Құпиясыздандырылған ПИН-код
4.Клиент ПИН-кодты ұмытып кетті
5.Клиенттің қалауы бойынша""",
    '''BCC.KZ жүйесін қолдануға қандай 
комиссия төленеді?''': """Қызметтер үшін төлемдер құны - 0 теңге (Қызмет көрсету үшін абоненттік төлем-0 теңге)""",
    """BCC.KZ жүйені қалай дұрыс пайдалану 
керек?""": """Сіз жүйені пайдалана аласыз:
Web-қосымша: https://m.bcc.kz сондай-ақ жергілікті (мобильді) қосымша BCC.KZ""",
    """BCC.KZ жүйесінің сипаттамасымен 
қайдан танысуға болады?""": """Жүйелердің толық сипаттамасымен мына сілтеме бойынша танысуға болады: https://www.bcc.kz/product/BCC.KZ/""",
    '''Қарыздың максималды сомасы қанша?''': """Қарыздың ең жоғары сомасы - 7 000 000 теңге.""",
    """Несиені рәсімдеу үшін банктің 
комиссиясы қандай?""": """Өтінімді қарағаны үшін Комиссия - 0 теңге 
Кредитті ресімдегені үшін банктің комиссиясы қарыз сомасының 5% -. құрайды (min 4500 теңге).
Кредитті ресімдегені үшін банктің комиссиясы қарыз сомасының 10% -. құрайды (min 4500 теңге).""",
    """Қарыз алушының жасына қатысты 
талаптар қандай?""": """Қарыздар қарыз беру сәтінде 21 жастан бастап және 68 жасқа дейінгі қарыз алушыларға беріледі.""",
    'Несие қанша күнде беріледі?': """Қарыздарды Банктің уәкілетті органы депозиттің қолданылу мерзімі шеңберінде белгілейді, бұл ретте депозит мерзімі қарыздар мерзімінен кемінде 3 (үш) жұмыс күніне асып кетуге тиіс.""",
    "Кім кепіл беруші бола алады?" : """Депозиттің кепіл берушісі қарыз алушының өзі де, кез келген басқа жеке немесе заңды тұлға да бола алады. Сақтандыру компанияларының резервтері болып табылатын депозиттер, түрлі қорлардың, қоғамдық бірлестіктердің қаражаттары және т. б. кепілге алынбайды.""",
    "Кредиттің қандай артықшылықтары бар?": """1.Төмен пайыздық мөлшерлемелер
2.Жеке өтеу кестесі (қарыз мерзімінің соңында негізгі борышты өтеу мүмкіндігімен)
3.Депозит бойынша қолданыстағы шарттарды сақтау мүмкіндігі
4.Несиені қараудың және берудің жылдам мерзімдері
5.Жобаның экономикалық сараптамасы қажет емес""",
    """Шот ашу үшін қанша комиссия ұстаунады?""": """Жеке тұлғалар үшін ағымдағы шот ашу-500 теңге.""",
    """Сомаларды аудару бойынша шектеулер 
бар ма?""": """Сомаларды аудару бойынша шектеулер жоқ. Уәкілетті банк клиенттердің (жеке тұлғалардың) қаражатының төлемдері мен аударымдары туралы ақпаратты, егер бір уәкілетті банк арқылы төлем және (немесе) ақша аудару сомасы 50 000 АҚШ долларының баламасынан асып кетсе, жеке тұлғаның күнтізбелік ай ішінде жүзеге асырылған операциялар туралы растайтын құжаттарды ұсыну мүмкіндігі болмаған кезде ҚР Ұлттық банкіне береді.""",
    """Аударымды алу үшін алушы қандай 
деректерді білуі керек?""": """Алушы білуі керек: 
1.аударымның бақылау нөмірі;
2.жіберушінің Толық аты-жөні; 
3.Ел және жөнелту қаласы; 
4.Аударым сомасы; 
5.Бақылау сұрағына жауап (егер сұрақ аудармаға енгізілген болса).""",
    """Кепілдік лимитін ашу мүмкін бе?""": """Тендерлік кепілдіктерді пайдаланатын клиенттерге кепілдіктер бойынша лимит ашылуы мүмкін. Кепілдіктер бойынша ашылатын лимит шеңберінде клиентке берілетін кепілдік міндеттемелердің әрбір кейінгі берілуі жаңартылатын негізде жүзеге асырылады. 
Лимиттің мерзімін, ашылатын лимиттің сомасын және кепілдік бергені үшін алынатын комиссияның мөлшерін Банктің уәкілетті органы белгілейді.""",
    """Банк қандай кепілдік түрлерін ұсынады?""": """Банк төлем кепілдіктерінің келесі түрлерін ұсынады: 
1.Төлем кепілдігі-сатушының сатып алушыға келісілген мерзім ішінде тауардың (жұмыстардың, көрсетілетін қызметтердің) келісімшарттық құнын төлеуге қатысты төлем талаптарының орындалуын қамтамасыз ету. 
2.Міндеттемелерді орындау кепілдігі-сатып алушының (Тапсырыс берушінің) сатушыға (мердігерге) қатысты орындалмауына немесе тиісінше орындалмауына байланысты туындауы мүмкін кез келген талаптардың (негізінен жеткізілмеген/орындалмаған жағдайда айыппұл санкцияларын төлеу) орындалуын қамтамасыз ету""",
    """Кепілдер бойынша төлемдер""": """Кепілгердің төлемдері кепілдік міндеттеменің шарттарына сәйкес Бенефициардың жазбаша өтінішін алғаннан кейін 3 жұмыс күні ішінде Банк есебінен жүзеге асырылады.
Төлем кепілдігі бойынша талапты негіздеу үшін Бенефициар, егер кепілдікте өзгеше көзделмесе, принципалдың кепілдікпен қамтамасыз етілген міндеттемелерді орындамағанын растайтын жазбаша құжаттарды қоса бере отырып, өзінің жазбаша өтінішін ұсынуға міндетті.
Банк кредит беру лимиті (несие желісі) шегінде берілген кепілдік міндеттеме бойынша төлемдерді жүзеге асырған жағдайда, осы лимит шегінде одан әрі кепілдіктер беру тоқтатылады.""",
    """Салымды ашу үшін банкке қандай 
құжаттарды ұсыну қажет?""": """Жаңадан құрылатын заңды тұлға үшін уақытша жинақ шотын ашуға арналған құжаттар тізбесі:
1.Уақытша жинақ шотын ашуға өтініш; 
2.ЖСН бар клиенттің жеке басын куәландыратын құжат;
3.Салымшының қолы қойылған құжаттың бір данасы; 
4.Қол қою үлгісімен құжатқа сәйкес уақытша жинақ шотын жүргізуге байланысты операциялар жасау кезінде төлем құжаттарына қол қоюға уәкілеттік берілген адамның (адамдардың) (олардың ЖСН-ін қамтитын) жеке басын куәландыратын құжаттың (құжаттардың) көшірмесі;
5.Уақытша жинақ шотын ашуға және жабуға уәкілетті жеке тұлғаны тағайындау туралы құрылатын заңды тұлға құрылтайшыларының хаттамасының көшірмесі.""",
    """Арнайы ағымдағы шоты кім және не үшін 
    ашылады?""": """Зейнетақы мен жәрдемақы төлеу жөніндегі мемлекеттік орталықтан төлемдер алу үшін арнайы ағымдағы шот ашылады
Арнайы тексеру шоты ашылуы мүмкін:
* туу/ бала күтімі бойынша жәрдемақы алатын азаматтарға және т. б.
* ЗТМО-дан жәрдемақы алатын клиенттерге.""",
    """Банктің басқа бөлімшелері арқылы 
салымды толықтыруға бола ма?""": """Шот иесі депозит қай бөлімшеде ашылғанына қарамастан, банктің кез келген бөлімшесінде салымды толықтыра алады."""
}
quick_translate_menu_k = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_k1 = KeyboardButton('Visa/Mastercard төлем карточкалары')
qtm_k2 = KeyboardButton('Банк жүйесі')
qtm_k3 = KeyboardButton('Несиелеу')
qtm_k4 = KeyboardButton('Бизнес-клиенттердің шоттары')
qtm_k5 = KeyboardButton('Аудармалар')
qtm_k6 = KeyboardButton('Кепілдіктер')
qtm_k7 = KeyboardButton('Жеке тұлғалардың депозиттері')
open_card_question_kaz = KeyboardButton('Біздің банктің картасын ашу💳')
location_bank_kaz = KeyboardButton('Ең жақын бөлімше және банкомат🏦')
connect_option_kaz = KeyboardButton('Операторға қосылу')
depozit_option_kaz = KeyboardButton('Біздің банктің депозитіне өтінім қалдырыңыз💴')
quick_translate_menu_k.add(open_card_question_kaz)
quick_translate_menu_k.add(location_bank_kaz)
quick_translate_menu_k.add(depozit_option_kaz)
quick_translate_menu_k.add(qtm_k1)
quick_translate_menu_k.add(qtm_k2)
quick_translate_menu_k.add(qtm_k3)
quick_translate_menu_k.add(qtm_k4)
quick_translate_menu_k.add(qtm_k5)
quick_translate_menu_k.add(qtm_k6)
quick_translate_menu_k.add(qtm_k7)
quick_translate_menu_k.add(connect_option_kaz)


quick_translate_menu_k_list = [qtm_k1.text, qtm_k2.text, qtm_k3.text, qtm_k4.text, qtm_k5.text, qtm_k6.text, qtm_k7.text]

qtm_k1_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_k1_1 = '''VISA/MasterCard картасына өтініш беру 
кезінде қажетті құжаттар?'''
qtm_k1_2 = '''Карточка арқылы балансты қалай 
толтыруға болады?'''
qtm_k1_3 = '''Картаны қандай жағдайларда ауыстыруға 
болады?'''
qtm_back_k = '⬅️Артқа'
qtm_k1_open.add(qtm_k1_1)
qtm_k1_open.add(qtm_k1_2)
qtm_k1_open.add(qtm_k1_3)
qtm_k1_open.add(qtm_back_k)

qtm_k2_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_k2_1 = '''BCC.KZ жүйесін қолдануға қандай 
комиссия төленеді?'''
qtm_k2_2 = """BCC.KZ жүйені қалай дұрыс пайдалану 
керек?"""
qtm_k2_3 = """BCC.KZ жүйесінің сипаттамасымен 
қайдан танысуға болады?"""
qtm_back_k = '⬅️Артқа'
qtm_k2_open.add(qtm_k2_1)
qtm_k2_open.add(qtm_k2_2)
qtm_k2_open.add(qtm_k2_3)
qtm_k2_open.add(qtm_back_k)

qtm_k3_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_k3_1 = '''Қарыздың максималды сомасы қанша?'''
qtm_k3_2 = """Несиені рәсімдеу үшін банктің 
комиссиясы қандай?"""
qtm_k3_3 = """Қарыз алушының жасына қатысты 
талаптар қандай?"""
qtm_back_k = '⬅️Артқа'
qtm_k3_open.add(qtm_k3_1)
qtm_k3_open.add(qtm_k3_2)
qtm_k3_open.add(qtm_k3_3)
qtm_k3_open.add(qtm_back_k)

qtm_k4_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_k4_1 = 'Несие қанша күнде беріледі?'
qtm_k4_2 = "Кім кепіл беруші бола алады?"
qtm_k4_3 = "Кредиттің қандай артықшылықтары бар?"
qtm_back_k = '⬅️Артқа'
qtm_k4_open.add(qtm_k4_1)
qtm_k4_open.add(qtm_k4_2)
qtm_k4_open.add(qtm_k4_3)
qtm_k4_open.add(qtm_back_k)

qtm_k5_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_k5_1 = """Шот ашу үшін қанша комиссия ұстаунады?"""
qtm_k5_2 = """Сомаларды аудару бойынша шектеулер 
бар ма?"""
qtm_k5_3 = """Аударымды алу үшін алушы қандай 
деректерді білуі керек?"""
qtm_back_k = '⬅️Артқа'
qtm_k5_open.add(qtm_k5_1)
qtm_k5_open.add(qtm_k5_2)
qtm_r5_open.add(qtm_k5_3)
qtm_k5_open.add(qtm_back_k)

qtm_k6_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_k6_1 = """Кепілдік лимитін ашу мүмкін бе?"""
qtm_k6_2 = """Банк қандай кепілдік түрлерін ұсынады?"""
qtm_k6_3 = """Кепілдер бойынша төлемдер"""
qtm_back_k = '⬅️Артқа'
qtm_k6_open.add(qtm_k6_1)
qtm_k6_open.add(qtm_k6_2)
qtm_k6_open.add(qtm_k6_3)
qtm_k6_open.add(qtm_back_k)

qtm_k7_open = ReplyKeyboardMarkup(resize_keyboard=True)
qtm_k7_1 = """Салымды ашу үшін банкке қандай 
құжаттарды ұсыну қажет?"""
qtm_k7_2 = """Арнайы ағымдағы шоты кім және не үшін 
    ашылады?"""
qtm_k7_3 = """Банктің басқа бөлімшелері арқылы 
салымды толықтыруға бола ма?"""
qtm_back_k = '⬅️Артқа'
qtm_k7_open.add(qtm_k7_1)
qtm_k7_open.add(qtm_k7_2)
qtm_k7_open.add(qtm_k7_3)
qtm_k7_open.add(qtm_back_k)


# most_popular_questions_kaz = ReplyKeyboardMarkup(resize_keyboard=True)
# questions_first_kaz = KeyboardButton('Кредиттік тарихымды көргім келеді. Кредиттік есепті қайдан ала аламын?')
# questions_second_kaz = KeyboardButton('BCC.KZ қалай жүктеп алуға болады?')
# connect_option_kaz = KeyboardButton('Операторға қосылу')
# open_card_question_kaz = KeyboardButton('Біздің банктің картасын ашу')
# location_bank_kaz = KeyboardButton('Ең жақын бөлімше және банкомат')
# questions_fourth_kaz = KeyboardButton('Есепшотты ашу үшін комиссия мөлшері қандай?')
# questions_fivth_kaz = KeyboardButton('Есепшот ашу және ақша аудару үшін қандай құжаттар қажет?')
# questions_third_kaz = KeyboardButton('Жеке тұлғаның атынан заңды тұлғаның атына ақша аударуға бола ма?')
# questions_six_kaz = KeyboardButton('Аударым қанша күн жүреді?')
# questions_seven_kaz = KeyboardButton('Бөлімшелердің жұмыс уақыты?')
# most_popular_questions_kaz.add(questions_first_kaz)
# most_popular_questions_kaz.add(questions_seven_kaz)
# most_popular_questions_kaz.add(open_card_question_kaz)
# most_popular_questions_kaz.add(location_bank_kaz)
# most_popular_questions_kaz.add(questions_second_kaz)
# most_popular_questions_kaz.add(questions_fourth_kaz)
# most_popular_questions_kaz.add(questions_fivth_kaz)
# most_popular_questions_kaz.add(questions_six_kaz)
# most_popular_questions_kaz.add(questions_third_kaz)
# most_popular_questions_kaz.add(connect_option_kaz)


# most_popular_questions_rus = ReplyKeyboardMarkup(resize_keyboard=True)
# questions_first_rus = KeyboardButton('Хочу посмотреть мою кредитную историю. Где я могу получить кредитный отчет?')
# questions_second_rus = KeyboardButton('Как скачать BCC.KZ?')
# connect_option = KeyboardButton('Связаться с оператором')
# open_card_question = KeyboardButton('Открыть карту нашего банка')
# location_bank = KeyboardButton('Ближайшее отделении и банкоматы')
# questions_fourth_rus = KeyboardButton('Какова комиссия за открытие счета?')
# questions_fivth_rus = KeyboardButton('Какие документы необходимы для открытия счета и отправки перевода?')
# questions_third_rus = KeyboardButton('''Как можно осуществить перевод денежных средств в иностранной
# валюте в зарубежье, если получатель имеет счет в банке''')
# questions_six_rus = KeyboardButton('Сколько дней идет перевод?')
# questions_sevens_rus = KeyboardButton('Время работы отделений банка?')
# most_popular_questions_rus.add(questions_first_rus)
# most_popular_questions_rus.add(questions_sevens_rus)
# most_popular_questions_rus.add(open_card_question)
# most_popular_questions_rus.add(location_bank)
# most_popular_questions_rus.add(questions_second_rus)
# most_popular_questions_rus.add(questions_fourth_rus)
# most_popular_questions_rus.add(questions_fivth_rus)
# most_popular_questions_rus.add(questions_six_rus)
# most_popular_questions_rus.add(questions_third_rus)
# most_popular_questions_rus.add(connect_option)